# Temperature Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomInitialColor..::..Temperature Property
CustomInitialColor Class See Also
---
The custom color temperature value.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Temperature { get; set; }
```

Visual Basic
---
```text
Public Property Temperature As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Temperature {
	double get ();
	void set (double value);
}
```

# ### Field Value
The color temperature in Kelvin as a numerical value between 1800 and 20000
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The color temperature is not valid because it is not in the range of 1800 to 20000. |

# See Also
CustomInitialColor Class
Autodesk.Revit.DB.Lighting Namespace